Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can use `@Inject @ConfigProperty` or just `@ConfigProperty`. The `@Inject` annotation is not necessary for members annotated with `@ConfigProperty`.
ja_jp: `@Inject @ConfigProperty` を使用することも、 `@ConfigProperty` だけを使用することもできます。 `@Inject` アノテーションは、 `@ConfigProperty` でアノテーションされたメンバーには必要ありません。

source: You can use `@Inject Logger log`, where the logger gets named after the class you inject it to, or `@Inject @LoggerName("...") Logger log`, where the logger will receive the specified name. Once injected, you can use the `log` object to invoke logging methods.
ja_jp: `@Inject Logger log` を使用すると、ロガーは注入したクラスと同じ名前になり、 `@Inject @LoggerName("…​") Logger log` を使用すると、ロガーは指定された名前になります。注入されると、 `log` オブジェクトを使用して、ロギングメソッドを呼び出すことができます。

source: You can use `@TestSecurity` and `@OidcSecurity` annotations for testing the `service` application endpoint code which depends on the injected `JsonWebToken` as well as `UserInfo` and `OidcConfigurationMetadata`.
ja_jp: `@TestSecurity` および `@OidcSecurity` アノテーションを使用して、注入された `JsonWebToken` ならびに `UserInfo` および `OidcConfigurationMetadata` に依存する `service` アプリケーションエンドポイントコードをテストできます。

source: You can use `@TestSecurity` and `@OidcSecurity` annotations to test the `service` application endpoint code, which depends on either one, or all three, of the following injections:
ja_jp: `@TestSecurity` および `@OidcSecurity` アノテーションを使用して、 `service` アプリケーションエンドポイントのコードをテストできます。このコードは、次の注入のいずれか 1 つまたは 3 つすべてに依存します。

source: You can use `@TestSecurity` and `@OidcSecurity` annotations to test the `web-app` application endpoint code, which depends on either one of the following injections, or all four:
ja_jp: `@TestSecurity` および `@OidcSecurity` アノテーションを使用して、次の注入のいずれか、または 4 つすべてに依存する `web-app` アプリケーションエンドポイントコードをテストできます。

source: You can use `AbstractPathAssert.satisfies(checkContains("some content"))` or any Path assert on the return of the methods above to also check the file contains a specific content.
ja_jp: 上記のメソッドの戻り値に `AbstractPathAssert.satisfies(checkContains("some content"))` または任意の Path アサートを使用して、ファイルに特定のコンテンツが含まれているかどうかを確認することもできます。

source: You can use `Event<CommandLine.ParseResult>` or just `CommandLine.ParseResult` to configure CDI beans based on arguments parsed by Picocli. This event will be generated in `QuarkusApplication` class created by this extension. If you are providing your own `@QuarkusMain` this event will not be raised. `CommandLine.ParseResult` is created from default `CommandLine` bean.
ja_jp: Picocli によって解析された引数に基づいて CDI Bean を設定するために、 `Event<CommandLine.ParseResult>` 、または単に `CommandLine.ParseResult` を使用することができます。このイベントは、このエクステンションによって作成された `QuarkusApplication` クラスで生成されます。独自の `@QuarkusMain` を提供している場合、このイベントは発生しません。 `CommandLine.ParseResult` はデフォルトの `CommandLine` Bean から作成されます。

source: You can use `OidcClient` directly to acquire access tokens and set them in an HTTP `Authorization` header as a `Bearer` scheme value.
ja_jp: `OidcClient` を直接使用してアクセストークンを取得して HTTP `Authorization` ヘッダーに `Bearer` スキーム値として設定できます。

source: You can use `OidcClient` methods for acquiring or refreshing tokens which accept additional grant parameters, for example, `oidcClient.getTokens(Map.of("client_assertion", "ey..."))`.
ja_jp: 追加のグラントパラメーターを受け入れるトークンを取得または更新するには、 `OidcClient` メソッドを使用できます (例: `oidcClient.getTokens(Map.of("client_assertion", "ey..."))`)。

source: You can use `Uni` and `Response` to return asynchronous HTTP responses: `Uni<Response>`.
ja_jp: `Uni<Response>` のように、 `Uni` と `Response` を使用して、非同期 HTTP レスポンスを返すことができます。

source: You can use `key-store-file` and `key-store-password` to configure the keystore file and its password when using JKS or P12. For PEM, use the `certificate` and `key` properties:
ja_jp: JKS または P12 を使用する場合、 `key-store-file` と `key-store-password` を使用してキーストアファイルとそのパスワードを設定できます。PEM の場合は、 `certificate` プロパティーと `key` プロパティーを使用します。

source: You can use `quarkus.keycloak.devservices.realm-path` to initialize Keycloak with multiple realm files by providing a comma-separated list of files:
ja_jp: `quarkus.keycloak.devservices.realm-path` を使って、カンマで区切られたファイルのリストを提供することで、複数のレルムファイルでKeycloakを初期化することができます:

source: You can use `quarkus.oidc.logout.post-logout-url-param` to work around this issue. You can also request more logout query parameters added with `quarkus.oidc.logout.extra-params`. For example, here is how you can support a logout with `Auth0`:
ja_jp: この問題を回避するには、 `quarkus.oidc.logout.post-logout-url-param` を使用できます。 `quarkus.oidc.logout.extra-params` で追加されたログアウトクエリーパラメーターをさらにリクエストすることもできます。たとえば、 `Auth0` でログアウトをサポートする方法は次のとおりです。

source: You can use `quarkus.oidc.logout.post-logout-url-param` to work around this issue. You can also request that more logout query parameters be added with `quarkus.oidc.logout.extra-params`. For example, here is how you can support a logout with `Auth0`:
ja_jp: この問題を回避するには、 `quarkus.oidc.logout.post-logout-url-param` を使用できます。 `quarkus.oidc.logout.extra-params` を使用して、さらにログアウトクエリーパラメーターを追加することもできます。 たとえば、`Auth0` でログアウトをサポートする方法は次のとおりです。

source: You can use a YAML file,`application.yaml`, to configure your {project-name} application instead of the standard Java properties file, `application.properties`.
ja_jp: 標準の Java プロパティファイル `application.properties` の代わりに、YAML ファイル `application.yaml` を使って {project-name} アプリケーションを設定することもできます。

source: You can use a configuration file to register classes for reflection.
ja_jp: 設定ファイルを使用してリフレクション用のクラスを登録することも可能です。

source: You can use a credential provider instead of passing the keystore password and alias password in the configuration.
ja_jp: 設定でキーストアのパスワードとエイリアスのパスワードを渡す代わりに、認証情報プロバイダーを使用できます。

source: You can use a credential provider instead of specifying the keystore and alias passwords in the configuration.
ja_jp: 設定でキーストアとエイリアスのパスワードを指定する代わりに、認証情報プロバイダーを使用できます。

source: You can use a local inlined public key for testing your `quarkus-oidc` `service` applications, as shown in the following example:
ja_jp: 次の例に示すように、 `quarkus-oidc` `service` アプリケーションをテストするために、ローカルのインライン公開鍵を使用できます。

source: You can use a regular expression in the path and also specify the HTTP methods where the HTTP header will be set:
ja_jp: パスには正規表現を使用でき、また HTTP ヘッダーが設定される HTTP メソッドを指定することもできます。

source: You can use a specific driver if you need to (for instance for using the OpenTracing driver) or if you want to use a database for which Quarkus does not have a built-in JDBC driver extension.
ja_jp: 必要に応じて (例えば OpenTracing ドライバーを使用する場合)、あるいはビルトイン JDBC ドライバー拡張のない Quarkus のデータベースを使用する必要がある場合は、特定のドライバーを使用できます。

source: You can use all the built-in scopes mentioned by the specification except for `jakarta.enterprise.context.ConversationScoped`.
ja_jp: `jakarta.enterprise.context.ConversationScoped` 以外の仕様で言及されているすべてのビルトインスコープを使用することができます。

source: You can use all the built-in scopes mentioned by the specification except for `javax.enterprise.context.ConversationScoped`.
ja_jp: `javax.enterprise.context.ConversationScoped` 以外の仕様で言及されているすべてのビルトインスコープを使用することができます。

source: You can use an `eraser` symbol in the right bottom corner to clear the test results area.
ja_jp: 右下の `eraser` のマークで、テスト結果エリアをクリアすることができます。

source: You can use any <<basic-building-blocks,building block>> in the template. In this case, the <<if_section>> is used to render the appropriate part of the message based on the input data.
ja_jp: テンプレートには、任意の <<basic-building-blocks,ビルディングブロック>> を使用することができます。この場合、<<if_section>> は、入力データに基づいてメッセージの適切な部分をレンダリングするために使用されます。

source: You can use any JDBC driver in a Quarkus app in JVM mode (see <<other-databases,Using other databases>>). It is unlikely that it will work when compiling your application to a native executable though.
ja_jp: JVM モードの Quarkus アプリでは、任意のJDBCドライバーを使用することができます (<<other-databases,Using other databases>> を参照)。しかし、アプリケーションをネイティブ実行可能ファイルにコンパイルした場合には動作しない可能性があります。

source: You can use any JDBC driver in a Quarkus app in JVM mode as described in <<other-databases,Custom databases and drivers>>. However, using a non-built-in database kind is unlikely to work when compiling your application to a native executable.
ja_jp: <<other-databases,Custom databases and drivers>> に記載されているように、Quarkus アプリケーションでは、JVM モードで任意の JDBC ドライバーを使用できます。 ただし、アプリケーションをネイティブ実行可能ファイルにコンパイルするときに、組み込みではないデータベースの種類を使用すると、機能しない可能性があります。

source: You can use any JDBC driver in a Quarkus app in JVM mode as described in <<other-databases,Using other databases>>. However, using a non-built-in database kind is unlikely to work when compiling your application to a native executable.
ja_jp: xref:other-databases[他のデータベースの使用] で説明するように、QuarkusアプリでJVMモードの任意のJDBCドライバを使用できます。 ただし、組込ではない種類のデータベースを使用すると、アプリケーションをネイティブ実行可能ファイルにコンパイルするときにうまくいかない可能性があります。

source: You can use any combination of small, primary, pill, with icon and clickable with any level of `default`, `success`, `warning`, `error`, `contrast`, or set your own colors.
ja_jp: small、primary、pill、アイコン付き、クリッカブル を `default`、 `success`、 `warning`、 `error`、 `contrast` の任意のレベルと組み合わせて使用することも、独自のカラーを設定することもできます。

source: You can use any of the Quarkus features in your function and benefit from the fast startup and low memory utilization. With Quarkus, you can embrace this new world without changing your programming language. Packaging and deployment are a breeze. Quarkus tailors your packaging to the environment you are targeting.
ja_jp: 関数内で Quarkus のあらゆる機能を使用でき、高速起動とメモリ使用量の低さのメリットを享受できます。Quarkus を使用すると、プログラミング言語を変更せずにこの新しい世界を取り入れることができます。パッケージ化とデプロイは簡単です。Quarkus は、ターゲットとする環境に合わせてパッケージ化を調整します。

source: You can use any of the Quarkus features in your function and benefit from the fast startup and low memory utilization. With Quarkus, you can embrace this new world without having to change your programming language.
ja_jp: 関数内でQuarkusのあらゆる機能を使用することができ、高速起動と低メモリ使用の恩恵を受けることができます。Quarkusでは、プログラミング言語を変更することなく、この新しい世界を受け入れることができます。

source: You can use any of the xref:hibernate-orm.adoc#setting-up-and-configuring-hibernate-orm[supported JDBC drivers].
ja_jp: xref:hibernate-orm.adoc#setting-up-and-configuring-hibernate-orm[サポートされている JDBC ドライバー] のいずれかを使用できます。

source: You can use any of the xref:hibernate-reactive.adoc#hr-getting-started[supported reactive drivers].
ja_jp: xref:hibernate-reactive.adoc#hr-getting-started[サポートされているリアクティブドライバー] のいずれかを使用できます。

source: You can use any xref:basic-building-blocks[building block] in the template. In this case, the xref:if_section[If Section] is used to render the appropriate part of the message based on the input data.
ja_jp: テンプレートには、任意の xref:basic-building-blocks[ビルディングブロック] を使用することができます。この場合、 xref:if_section[Ifセクション] は、入力データに基づいてメッセージの適切な部分をレンダリングするために使用されます。

source: You can use both clients in a native executable.
ja_jp: ネイティブ実行可能ファイルで両方のクライアントを使用することができます。

source: You can use bracket notation if you need to specify an identifier that contains a dot, e.g. `{map['my.key']}`.
ja_jp: ドットを含む識別子を指定する必要がある場合は、ブラケット表記を使用することができます (例: `{map['my.key']}`)。

source: You can use either the Query DSL or the Ickle Query language with the Quarkus Infinispan client extension.
ja_jp: Quarkus Infinispanクライアントエクステンションでは、Query DSLまたはIckle Query 言語のいずれかを使用できます。

source: You can use enhanced conversion of a config item by using the `@ConvertWith` annotation which accepts a `Converter` class object. If the annotation is present on a config item, the implicit or custom built in converter in use will be overridden by the value provided. To do, see the example below which converts `YES` or `NO` values to `boolean`.
ja_jp: `Converter` クラス・オブジェクトを受け付ける `@ConvertWith` アノテーションを使用すると、設定項目の強化された変換を使用できます。 このアノテーションが設定項目に存在する場合、使用されている暗黙のまたはカスタム組み込みコンバータは、指定された値によってオーバーライドされます。 そのためには、 `YES` または `NO` の値を `boolean` に変換する以下の例を参照してください。

source: You can use it to restrict which fields will be returned by the database, the ID field will always be returned, but it's not mandatory to include it inside the projection class.
ja_jp: これを使って、データベースから返されるフィールドを制限することができます。IDフィールドは常に返されますが、これをプロジェクションクラス内に含めることは必須ではありません。

source: You can use it to restrict which fields will be returned by the database.
ja_jp: これを使って、データベースから返されるフィールドを制限することができます。

source: You can use link:https://github.com/eclipse/microprofile-open-api[MicroProfile OpenAPI] to better document your schema, example, adding header info, or specifying the return type on `void` methods might be usefull :
ja_jp: link:https://github.com/eclipse/microprofile-open-api[MicroProfile OpenAPI ] を使用してスキーマをより良くドキュメント化することができます。例えば、ヘッダ情報を追加したり、 `void` メソッドでリターンタイプを指定したりすると便利です。

source: You can use link:https://github.com/eclipse/microprofile-open-api[MicroProfile OpenAPI] to better document your schema, example, adding the following to the class level of the `GreetingController`:
ja_jp: link:https://github.com/eclipse/microprofile-open-api[MicroProfile OpenAPI]を使用して、スキーマをより良く文書化することができます。例えば、 `GreetingController` のクラスレベルに以下を追加します:

source: You can use link:https://github.com/eclipse/microprofile-open-api[MicroProfile OpenAPI] to better document your schema, for instance, adding header info, or specifying the return type on `void` methods might be useful:
ja_jp: link:https://github.com/eclipse/microprofile-open-api[MicroProfile OpenAPI] を使用してスキーマをよりよくドキュメント化することができます。例えば、ヘッダー情報を追加したり、 `void` メソッドの戻り値の型を指定したりすると便利かもしれません:

source: You can use link:https://github.com/quarkiverse/quarkus-ngrok[Quarkiverse ngrok] in dev mode or reserve it directly in the ngrok dashboard. Unfortunately, you cannot use your ngrok domain to test the Quarkus Let's Encrypt ACME feature immediately. This is because ngrok itself uses Let's Encrypt and intercepts ACME challenges that are meant to be handled by the Quarkus application instead.
ja_jp: 開発モードで link:https://github.com/quarkiverse/quarkus-ngrok[Quarkiverse ngrok] を使用するか、ngrok ダッシュボードで直接予約できます。 残念ながら、ngrok ドメインを使用して Quarkus Let's Encrypt ACME 機能をすぐにテストすることはできません。 これは、ngrok 自体が Let's Encrypt を使用し、Quarkus アプリケーションで処理されるはずの ACME チャレンジを傍受するためです。

source: You can use link:https://openid.net/specs/openid-connect-frontchannel-1_0.html[Front-channel logout] to log out the current user directly from the user agent, for example, its browser. It is similar to <<back-channel-logout,Back-channel logout>> but the logout steps are executed by the user agent, such as the browser, and not in the background by the OIDC provider. This option is rarely used.
ja_jp: link:https://openid.net/specs/openid-connect-frontchannel-1_0.html[フロントチャネルログアウト] を使用すると、ユーザエージェント（ブラウザなど）から現在のユーザを直接ログアウトすることができます。 これは xref:back-channel-logout[バックチャネルログアウト] と似ていますが、ログアウトの手順はOIDCプロバイダによってバックグラウンドで実行されるのではなく、ブラウザなどのユーザーエージェントによって実行されます。 このオプションはほとんど使用されません。

source: You can use our xref:funqy-gcp-functions.adoc[Google Cloud Functions Funqy binding] to use Funqy, a provider agnostic function as a service framework, that allow to deploy HTTP function or Background function to Google Cloud.
ja_jp: xref:funqy-gcp-functions.adoc[Google Cloud Functions Funqyバインディング] を使用すると、プロバイダに依存しないFunction as a ServiceフレームワークであるFunqyを使用して、HTTP関数やBackground関数をGoogle Cloudにデプロイできます。

source: You can use our xref:funqy-gcp-functions.adoc[Google Cloud Functions Funqy binding] to use Funqy, a provider-agnostic function as a service framework, that allow to deploy HTTP function or Background function to Google Cloud.
ja_jp: Google link:funqy-gcp-functions.html[Cloud Functions Funqy バインディング] を使用すると、プロバイダに依存しない Service as a Service フレームワークである Funqy を使用することができ、HTTP 関数や Background 関数を Google Cloud にデプロイすることができます。

source: You can use programmatic lookup via `jakarta.enterprise.inject.Instance` to resolve ambiguities at runtime and even iterate over all beans implementing a given type:
ja_jp: 実行時に曖昧さを解決するために、 `jakarta.enterprise.inject.Instance` を介してプログラム的な検索を使用することができ、さらに、指定された型を実装するすべてのBeanを反復処理することができます：

source: You can use public fields or private fields with getters/setters. If you don't want to manage the ID by yourself, you can make your entity extends `PanacheMongoEntity`.
ja_jp: ゲッターやセッターを使って、パブリックフィールドやプライベートフィールドを使うことができます。IDを自分で管理したくない場合は、 `PanacheMongoEntity` を拡張したエンティティを作ることができます。

source: You can use query params to filter the output:
ja_jp: クエリーパラメーターを使用して出力をフィルタリングすることができます。

source: You can use secrets engines with Quarkus to store, generate, or encrypt data.
ja_jp: Quarkus でシークレットエンジンを使用して、データを保存、生成、または暗号化できます。

source: You can use static methods on `QuarkusTransaction` to define transaction boundaries. This provides two different options, a functional approach that allows you to run a lambda within the scope of a transaction, or by using explicit `begin`, `commit` and `rollback` methods.
ja_jp: `QuarkusTransaction` の静的メソッドを使用して、トランザクションの境界を定義できます。これは、トランザクションの範囲内でラムダを実行できる関数的なアプローチと、明示的な `begin`, `commit`, `rollback` のメソッドを使用することによる2つの異なるオプションを提供します。

source: You can use that generated UUID as the consumer group as follows:
ja_jp: その生成された UUID をコンシューマーグループとして、以下のように使用することができます。

source: You can use the <<integration-test>> to help develop your codestart with `buildAllProjects` (In Quarkus core we added `@EnabledIfSystemProperty(named = "build-projects", matches = "true")` because codestarts are already built together in another test from `QuarkusCodestartBuildIT`).
ja_jp: `buildAllProjects` （Quarkus coreでは、 `@EnabledIfSystemProperty(named = "build-projects", matches = "true")` でcodestart開発を補助するために link:#integration-test[結合テスト]を使用することが出来ます。これは、codestartがすでに別のテストで `QuarkusCodestartBuildIT` から一緒にビルドされているためです）。

source: You can use the JPA entity manager directly. You can also use Panache, an alternative that removes boilerplate and exposes active records or repository models. With Panache, the `Element` class would be as simple as:
ja_jp: JPA エンティティー マネージャーを直接使用できます。また、定型句を削除し、アクティブレコードまたはリポジトリー モデルを公開する代替手段である Panache を使用することもできます。Panache を使用すると、`Element` クラスは次のように単純になります。

source: You can use the JPA entity manager directly. Panache proposes an alternative removing boilerplate and exposing an active record and repository models.
ja_jp: JPAのエンティティマネージャーを直接使用することができます。Panacheは、ボイラープレートを取り除き、アクティブなレコードとリポジトリモデルを公開するという代替案を提示します。

source: You can use the MongoDB client in a native executable.
ja_jp: MongoDBクライアントをネイティブ実行可能ファイルで使うことができます。

source: You can use the OpenID Connect extension to configure the adapter settings through the `application.properties` file, typically located in the `src/main/resources` directory. For example:
ja_jp: OpenID Connect エクステンションを使用すると、通常は `src/main/resources` ディレクトリーにある `application.properties` ファイルを通じてアダプター設定を行うことができます。 以下に例を示します。

source: You can use the OpenShift web console to verify that the above command has created an image stream, a service resource and has deployed the application. Alternatively, you can run the following OpenShift CLI commands:
ja_jp: OpenShift の Web コンソールを使用して、上記のコマンドでイメージストリーム、サービスリソースが作成され、アプリケーションがデプロイされたことを確認できます。あるいは、以下のOpenShift CLIコマンドを実行することもできます:

source: You can use the Quarkus OpenID Connect (OIDC) extension to secure your JAX-RS applications using Bearer Token Authorization. The Bearer Tokens are issued by OIDC and OAuth 2.0 compliant authorization servers, such as https://www.keycloak.org[Keycloak].
ja_jp: このガイドでは、Quarkus OpenID Connect (OIDC) Extensionを使用して、Bearer TokenがOpenID Connectや link:https://www.keycloak.org[Keycloak] などのOAuth 2.0準拠の認可サーバーによって発行されるBearer Token認可を使用して、JAX-RSアプリケーションを保護する方法を説明します。

source: You can use the SmallRye JWT Build API independently, without creating MicroProfile JWT endpoints supported by the `quarkus-smallrye-jwt` extension.
ja_jp: SmallRye JWT Build API は、 `quarkus-smallrye-jwt` エクステンションがサポートする MicroProfile JWT エンドポイントを作成せずに、単独で使用できます。

source: You can use the `@RunAsUser` annotation on methods annotated with the `@Scheduled` annotation to configure the `SecurityIdentity` for the task execution. The `@RunAsUser` annotation works only for the scheduled tasks.
ja_jp: `@Scheduled` アノテーションが付けられたメソッドでは、`@RunAsUser` アノテーションを使用してタスク実行の `SecurityIdentity` を設定できます。`@RunAsUser` アノテーションは、スケジュールされたタスクでのみ機能します。

source: You can use the `@RunOnVirtualThread` annotation:
ja_jp: `@RunOnVirtualThread` アノテーションは、次のような形で使用できます。

source: You can use the `basePackages` property to scan a full package containing your classes. You can override the default marshalling by using the `@Protofield` annotation.
ja_jp: `basePackages` プロパティを使用すると、クラスを含む完全なパッケージをスキャンできます。 `@Protofield` アノテーションを使用すると、既定のマーシャリングをオーバーライドできます。

source: You can use the `html` function from `Lit`, which gives you a template language to output the HTML you want. Once the template is created, you must only set or change the properties to re-render the page content. Read more about https://lit.dev/docs/components/rendering/[Lit html]
ja_jp: `Lit` の `html` 関数を使用できます。これにより、必要な HTML を出力するためのテンプレート言語が提供されます。テンプレートが作成されたら、プロパティーを設定または変更するだけでページコンテンツを再レンダリングできます。 https://lit.dev/docs/components/rendering/[Lit html] の詳細はこちらを参照してください。

source: You can use the `io.quarkus.arc.runtime.BeanContainer` interface to interact with your extension beans. The following `configureBeans` methods illustrate interacting with the beans scanned for in the previous section:
ja_jp: `io.quarkus.arc.runtime.BeanContainer` インターフェイスを使用して、エクステンション Bean とインタラクトできます。次の `configureBeans` メソッドは、前のセクションでスキャンされた Bean とのインタラクションを示しています。

source: You can use the `io.quarkus.devservices.compose.exposed_ports` label to specify a file path inside the container where port mappings will be written:
ja_jp: `io.quarkus.devservices.compose.exposed_ports` ラベルを使用して、ポートマッピングが書き込まれるコンテナー内のファイルパスを指定できます:

source: You can use the `io.quarkus.oidc.Tenant` annotation for resolving the tenant identifiers as an alternative to using `io.quarkus.oidc.TenantResolver`.
ja_jp: `io.quarkus.oidc.TenantResolver` を使用する代わりに、`io.quarkus.oidc.Tenant` アノテーションを使用してテナント識別子を解決できます。

source: You can use the `quarkus.oidc.tenant-paths` configuration property for resolving the tenant identifier as an alternative to using `io.quarkus.oidc.TenantResolver`. Here is how you can select the `hr` tenant for the `sayHello` endpoint of the `HelloResource` resource used in the previous example:
ja_jp: `io.quarkus.oidc.TenantResolver` を使用する代わりに、`quarkus.oidc.tenant-paths` 設定プロパティーを使用してテナント識別子を解決することができます。 前の例で使用した `HelloResource` リソースの `sayHello` エンドポイントに `hr` テナントを選択する方法は次のとおりです。

source: You can use the `quarkus.otel.traces.suppress-application-uris` property to exclude specific endpoints from being traced.
ja_jp: `quarkus.otel.traces.suppress-application-uris` プロパティーを使用して、特定のエンドポイントをトレース対象から除外できます。

source: You can use the `setnx` method only to set the value if no value has been stored for the given key.
ja_jp: `setnx` メソッドは、指定したキーに対応する値が格納されていない場合に、値を設定するためだけに使用することができます。

source: You can use the `smallrye.jwt.sign.key.location` and `smallrye.jwt.encrypt.key.location` properties to specify the locations of signing and encryption keys. These keys can be located on the local file system, on the classpath, or fetched from remote endpoints. Keys can be in `PEM` or `JSON Web Key (JWK)` formats. For example:
ja_jp: `smallrye.jwt.sign.key.location` プロパティーと `smallrye.jwt.encrypt.key.location` プロパティーを使用して、署名キーと暗号鍵の場所を指定できます。これらのキーは、ローカルファイルシステム、クラスパス、またはリモートエンドポイントから取得できます。キーは `PEM` または `JSON Web Key (JWK)` 形式に指定できます。例:

source: You can use the annotations and CDI interceptors for resolving the tenant identifiers as an alternative to using `quarkus.oidc.TenantResolver`. This can be done by setting the value for the key `OidcUtils.TENANT_ID_ATTRIBUTE` on the current `RoutingContext`.
ja_jp: `quarkus.oidc.TenantResolver` を使用する代わりに、アノテーションと CDI インターセプターを使用してテナント識別子を解決できます。これは、現在の `RoutingContext` のキー `OidcUtils.TENANT_ID_ATTRIBUTE` の値を設定することで実行できます。

source: You can use the built-in JsonRPC controller to access the any of the methods you defined. Runtime, Deployment and Recorded all works the same way in the WebComponent.
ja_jp: 組み込みの JsonRPC コントローラーを使用して、定義した任意のメソッドにアクセスできます。ランタイム、デプロイメント、記録済みはすべて Web コンポーネントで同じように機能します。
